import java.util.ArrayList;
import java.util.Collections;

public class CrtTest {
	
/*	public Question[] questions;
		public CrtTest () {
		questions = new Question[] {
				new Question("מהו שמו של הספר הראשון בתורה?", "בראשית", "שמות", "דברים", "ויקרא"),
				new Question("כמה מונים בשבטי ישראל?", "12", "י10", "8", "4"),
				new Question("מי הם אבות האומה היהודית?", "אברהם, יצחק ויעקב", "יוסף, בנימין, יהודה", "דוד, שלמה, רחבעם", "שאול, דוד, שלמה"),
				new Question("מהו שמו של המלך הראשון של ישראל המאוחדת?", "שאול", "דוד", "שלמה", "רחבעם"),
				new Question("מהו שמו של המלך השני של ישראל המאוחדת?", "דוד", "שלמה", "רחבעם", "ירבעם"),
				new Question("מי משבטי ישראל היה שליט במצרים?", "יוסף", "יהודה", "בנימין", "מנשה"),
				new Question("מהו שם מלך  יהודה לאחר פילוג הממלכה?", "רחבעם", "ירבעם", "צדקיהו", "אסא"),
				new Question("מהו שם מלך ישראל לאחר פילוג הממלכה?", "ירבעם", "צדקיהו", "אסא", "חזקיהו"),
				new Question("מהו שם מלך יהודה האחרון?", "צדקיהו", "אסא", "חזקיהו", "יהויכין"),
				new Question("מהו שם העיר בה נמצא בית המקדש הראשון והשני?", "ירושלים", "שומרון", "תמר", "צפון"),
				new Question("איזה מלך יהודה מלך בחיי אביו?", "יותם", "עוזיה", "שלמה", "אסא"),
				new Question("מהו שמו של המלך הרומאי שהחריב את בית המקדש השני?", "טיטוס", "נירון", "אספסיאנוס", "קליאופטרה"),
				new Question("מהו שמו של הספר האחרון בתורה?", "דברים", "בראשית", "שמות", "ויקרא"),
				new Question("מהו שמו של הספר הראשון בנביאים?", "יהושע", "שופטים", "שמות", "בראשית"),
				new Question("מהו שמו של הספר האחרון בנביאים?", "מלאכי", "זכריה", "יחזקאל", "ישעיהו")
			};
	} 
*/	

	public ArrayList<Question> questions;
	private int numOfCorrectAns = 0;

	public CrtTest () {
	    questions = new ArrayList<>();
		questions.add(new Question("מהו שמו של הספר הראשון בתורה?", "בראשית", "שמות", "דברים", "ויקרא"));
		questions.add(new Question("כמה מונים בשבטי ישראל?", "12", "10", "8", "4"));
		questions.add(new Question("מי הם אבות האומה היהודית?", "אברהם, יצחק ויעקב", "יוסף, בנימין, יהודה", "דוד, שלמה, רחבעם", "שאול, דוד, שלמה"));
		questions.add(new Question("מהו שמו של המלך הראשון של ישראל?", "שאול", "דוד", "שלמה", "רחבעם"));
		questions.add(new Question("מי מהמלכים הבאים מלך הכי הרבה?", "חזקיהו", "ירבעם בן נבט", "אחאב", "צדקיהו"));
		questions.add(new Question("מי משבטי ישראל היה שליט במצרים?", "יוסף", "יהודה", "בנימין", "מנשה"));
		questions.add(new Question("מהו שם מלך  יהודה לאחר פילוג הממלכה?", "רחבעם", "ירבעם", "צדקיהו", "אסא"));
		questions.add(new Question("מהו שם מלך ישראל לאחר פילוג הממלכה?", "ירבעם", "צדקיהו", "אסא", "חזקיהו"));
		questions.add(new Question("מהו שם מלך יהודה האחרון?", "צדקיהו", "אסא", "חזקיהו", "יהויכין"));
		questions.add(new Question("מהו שם העיר בה נמצא בית המקדש הראשון והשני?", "ירושלים", "שומרון", "תמר", "צפון"));
		questions.add(new Question("איזה מלך יהודה מלך בחיי אביו?", "יותם", "עוזיה", "שלמה", "אסא"));
		questions.add(new Question("מהו שמו של המלך הרומאי שהחריב את בית המקדש השני?", "טיטוס", "נירון", "אספסיאנוס", "קליאופטרה"));
		questions.add(new Question("מהו שמו של הספר האחרון בתורה?", "דברים", "בראשית", "שמות", "ויקרא"));
		questions.add(new Question("מהו שמו של הספר הראשון בנביאים?", "יהושע", "שופטים", "שמות", "בראשית"));
		questions.add(new Question("מהו שמו של הספר האחרון בנביאים?", "מלאכי", "זכריה", "יחזקאל", "ישעיהו"));
		
		Collections.shuffle(questions);
	}

	public int getNumOfCrctAns() {
		return numOfCorrectAns;
	}

	public void updateNumOfCrctAns() {
		this.numOfCorrectAns++;
	}

	public Question getCrt() {
		return questions.get(0);
	}
	
	
}